[
  {
    "company": "IBM",
    "positions": [
      {
        "title": "Backend Development Co-op",
        "duration": "August 2023 - Present.",
        "notes": [
          "Working alongside the data scientists in the Devices Data Insights team to develop efficient data-processing solutions.",
          "Developing a robust pipeline to rapidly transport millions of records from ServiceNow to IBM Cloud Object Storage."
        ]
      },
      {
        "title": "Backend Development Intern",
        "duration": "May 2023 - August 2023.",
        "notes": [
          "Contributed to the strategic re-architecture of a global Vue.js/Spring Boot application that facilitates over 315k users, including all IBM employees.",
          "Lead a pivotal role in the transformation of the application from a monolithic design to a microservices-based structure.",
          "Refined and implemented modern authentication and authorization mechanisms, significantly improving system security and user experience by ensuring the right access controls for various user roles.",
          "Collaborated closely with a dynamic team and adapting to agile methodologies.",
          "Reduced on-page-load API calls by 68% by re-organizing and optimizing data retrieval."
        ]
      }
    ]
  },
  {
    "company": "ACTprep.com, Inc.",
    "positions": [
      {
        "title": "Software Engineer",
        "duration": "March 2023 - Present.",
        "notes": [
          "Managing the technology division of ACTprep.com.",
          "Leading the development and maintenance of the ACTprep.com web application: an application designed to receive and process all company data for the purpose of coaching, analytics, student progress monitoring, and more.",
          "This application serves approximately 100 daily users and involves over 30 unique database tables.",
          "Improving scale of the company by increasing the total possible students a coach can mentor by over 100%.",
          "Consistently decreasing company costs, having reduced annual labor/supplies costs by over $50,000."
        ]
      },
      {
        "title": "Software Developer",
        "duration": "May 2022 - August 2022.",
        "notes": [
          "Developed a web application that utilizes the Google Sheets API to store student enrollment data provided by new students as they traverse through the application’s enrollment process.",
          "Streamlined the ACTprep.com enrollment process by relieving the enrollment coordinator of the need to retrieve student enrollment data through text communication.",
          "Facilitated the enrollment process of over 100 students using this application."
        ]
      }
    ]
  },
  {
    "company": "Make Me Modern, Inc.",
    "positions": [
      {
        "title": "Software Developer",
        "duration": "August 2022 - March 2023.",
        "notes": [
          "Managed and developed the ACTprep.com web application project.",
          "Assisted in backend and frontend development for assorted company projects.",
          "Accelerated the primary data query speed of https://postageapi.com/stats/ page by over 99%.",
          "Developed a data pipeline to fully migrate a MySQL database to a MongoDB Atlas Cluster while maintaining table relationships for a database containing over 150,000 total records."
        ]
      }
    ]
  }
]