[
  {
    "company": "IBM",
    "positions": [
      {
        "title": "Software Engineer Intern",
        "duration": "May 2023 - Present",
        "notes": [
          "Developing end-to-end software for Devices@IBM, including a full-stack application that supports employee device-related operations, data pipelines to support the web application, and exploratory data analysis to inform device provisioning decisions.",
          "Developed a Python service that supports all data pipelines and reporting related to employee device tier assignment, leveraging data from IBM DB2, PostgreSQL, and ServiceNow.",
          "Migrated 100% of all regular Devices@IBM data pipelines to the same Python data science framework, leading to significant improvements in code maintainability and professionalism.",
          "Increased the data transfer speed of a crucial data pipeline by 12mb/s (300%) by developing a multi-threaded REST API batch processing solution in Python, successfully replacing a sunsetting technology.",
          "Re-architected a Vue.js client application and implemented a modern SSO system, leading to a 68% reduction in on-page-load API calls, a 50% reduction in build size, and a 99% reduction in login-related support tickets, impacting over 315,000 users."
        ]
      }
    ]
  },
  {
    "company": "ACTprep.com, Inc.",
    "positions": [
      {
        "title": "Software Engineer",
        "duration": "May 2022 - Present",
        "notes": [
          "Founded and currently leading the software engineering team at ACTprep.com, including continuous design, development, and maintenance of features to support over 130 daily active users and over 1,000 users all-time.",
          "Developed over 95% of all company software, focusing on automation and powerful data analytics, leading to a $50,000 reduction in labor and supply costs, a 67% increase in student-per-coach capacity, and enabling the company to scale to 6 additional states.",
          "Designed entire company software infrastructure, including a Django/PosgreSQL backend API, a Docker network of React apps served by nginx, and an AWS S3 instance to facilitate backups and media file storage.",
          "Developed numerous features that have revolutionized company processes, including a student monitoring dashboard for parents, multiple analytics dashboards for coaches, a fully-automated enrollment process, a student program builder, a mock ACT testing solution, and a comprehensive student app featuring performance metrics, text reminders, a daily schedule, fully-digitized curriculum, a digital answer sheet, and a practice test analysis tool."
        ]
      }
    ]
  }
]
