[
  {
    "company": "IBM",
    "positions": [
      {
        "title": "Software Engineer Intern",
        "duration": "May 2023 - Present",
        "notes": [
          "Developed a REST API using FastAPI that serves employee device performance and health score data, improving accuracy of reactive IT support for over 300,000 devices.",
          "Integrated device performance data into employee device provisioning logic, allowing 110,000+ employees to receive a device catered towards their specific computation needs.",
          "Increased the data transfer speed of a crucial data pipeline by 12mb/s (300%) by developing a multi-threaded REST API batch processing solution in Python, successfully replacing a sunsetting technology.",
          "Re-architected a Vue.js client application and implemented a modern SSO system, leading to a 68% reduction in on-page-load API calls and a 99% reduction in login-related support tickets, impacting over 300,000 users."
        ]
      }
    ]
  },
  {
    "company": "ACTprep.com, Inc.",
    "positions": [
      {
        "title": "Software Engineer",
        "duration": "May 2022 - Present",
        "notes": [
          "ACTprep.com is a Knoxville-based ACT tutoring company with a focus on developing students’ study skills and preparing them for college.",
          "Founded and currently leading the technical team, including continuous design, development, and maintenance of features to support over 130 daily active users and over 2,000 users all-time.",
          "Built web applications that automated and digitized every aspect of the company, cutting costs by $50,000, doubling student capacity per coach, and preparing the company to scale nationwide.",
          "Built a mock ACT digital testing app, with more than 18,000 tests administered.",
          "Built a student dashboard that has now logged 50,000+ hours of student use with fully automated guidance through the program.",
          "Enabled the creation of over 100 4+ star rated test questions through a feature that allows students to generate new test questions through OpenAI’s gpt-4o REST API."
        ]
      }
    ]
  }
]
